[
    [
        {
            "calories": 129.0,
            "categories": [
                "Cookies",
                "Rum",
                "Cheese",
                "Dairy",
                "Fruit",
                "Dessert",
                "Bake",
                "Banana",
                "Winter",
                "Gourmet",
                "Kidney Friendly",
                "Vegetarian",
                "Pescatarian",
                "Peanut Free",
                "Tree Nut Free",
                "Soy Free",
                "Kosher"
            ],
            "date": 1093006128000,
            "desc": "To bake these puffs all at once, you will need 6 mini-muffin pans, each containing twelve 1 3\/4- by 1-inch cups. However, you could also make them in batches using fewer pans.",
            "directions": [
                "Cut butter into 1\/4-inch slices. In a large bowl with your fingertips or a pastry blender blend together flour, salt, and butter until mixture resembles coarse meal with some pea-size lumps of butter. Stir in sour cream with a fork until incorporated and form dough into a ball.",
                "Divide dough into 6 portions and form each piece into a 5-inch square. Chill dough, wrapped separately in plastic wrap, until firm, at least 2 hours, and up to 3 days, or freeze, wrapped well, up to 1 month.",
                "Mash enough of bananas to measure 1 cup and in a bowl stir together with remaining filling ingredients until smooth.",
                "On a lightly floured surface roll out 1 dough square (keep remaining dough chilled or frozen) into a 15- by 6-inch rectangle (about 1\/8 inch thick). With a sharp knife and a ruler cut rectangle into ten 3-inch squares. Lay squares over ungreased mini-muffin cups (2 cups will remain empty) and drop 1 heaping teaspoon filling onto center of squares. Bring all four corners of squares together and press gently to seal (filling will not be completely enclosed; this process will ease filled pastries into muffin cups). Chill filled pastries 30 minutes. Make more pastries in same manner.",
                "Preheat oven to 375°F.",
                "Bake pastries in batches in lower third of oven until pale golden, 20 to 25 minutes. Cool pastries in pans on racks 10 minutes and transfer to racks to cool completely. Pastries keep, layered between sheets of wax paper in airtight containers, and frozen, 2 weeks. Before serving, thaw puffs and reheat in one layer on a baking sheet in a 325°F oven 7 to 10 minutes. Cool puffs on a rack.",
                "Dust puffs with confectioners' sugar before serving."
            ],
            "fat": 9.0,
            "ingredients": {
                "unsalted butter" : "4",
                "flour" : "4",
                "salt" : "0.25",
                "sour cream" : "1",
                "bananas" : "2",
                "cream cheese" : "12",
                "granulated sugar" : "0.5",
                "egg yolks" : "2",
                "rum" : "2",
                "fresh lemon juice" : "2",
                "sugar" : "0.5"
            },
            "protein": 1.0,
            "rating": 4.375,
            "sodium": 34.0,
            "title": "Banana Rum Puffs "
            },
            {
            "calories": 105.0,
            "categories": [
                "Cookies",
                "Food Processor",
                "Fruit",
                "Dessert",
                "Bake",
                "Vegetarian",
                "Cream Cheese",
                "Apricot",
                "Cherry",
                "Coconut",
                "Bon Appétit",
                "Florida",
                "Kidney Friendly",
                "Pescatarian",
                "Peanut Free",
                "Tree Nut Free",
                "Soy Free",
                "Kosher"
            ],
            "date": 1092974400000,
            "desc": "These cookies are perfect with a cup of tea.",
            "directions": [
                "Combine first 3 ingredients in processor; blend until clumps form. Gather dough into ball; flatten into square. Wrap in plastic; freeze until cold enough to roll, about 15 minutes, or refrigerate up to 1 day.",
                "Preheat oven to 375°F. Butter baking sheet. Cut dough crosswise in half. Roll out each piece on floured surface to 12x8-inch rectangle. Spread each with 1\/4 cup jam. Top each with 1\/2 cup coconut and 1\/2 cup cherries. Starting at 1 long side, roll dough up jelly-roll style; seal long seam. Cut each roll crosswise into 12 pieces. Arrange pieces, cut side up, on prepared sheet. Flatten each to 1\/2-inch thickness.",
                "Bake cookies until golden brown, about 25 minutes. Cool on rack."
            ],
            "fat": 7.0,
            "ingredients": {
                "flour" : "1",
                "cream cheese" : "4",
                "unsalted butter" : "0.5",
                "apricot jam" : "0.5",
                "sweetened flaked coconut" : "1",
                "dried tart" : "1"
            },
            "protein": 1.0,
            "rating": 3.125,
            "sodium": 31.0,
            "title": "Cream Cheese Strudel Cookies "
            },
            {
            "calories": 87.0,
            "categories": [
                "Cookies",
                "Dessert",
                "Bake",
                "Christmas",
                "Kid-Friendly",
                "Vanilla",
                "Birthday",
                "Family Reunion",
                "Christmas Eve",
                "Party",
                "Potluck",
                "Butter",
                "Gourmet",
                "Kidney Friendly",
                "Vegetarian",
                "Pescatarian",
                "Peanut Free",
                "Tree Nut Free",
                "Soy Free",
                "Kosher"
            ],
            "date": 1324526400000,
            "desc": "When it comes right down to it, the simplest holiday cookie is, hands down, this sugar cookie. No rolling pin or sheets of wax paper are required. Just roll the dough into balls between your palms, then coat them with decorative coarse sugars. This is the perfect cookie for children starting out in the kitchen, by the way. They'll have loads of fun mixing up different colors of the sanding sugar, and messy kitchen aside, everyone will be happy when they sink their teeth into the first ones warm from the oven.",
            "directions": [
                "Beat together butter, sugar, and salt in a large bowl with an electric mixer at medium-high speed until pale and fluffy, about 3 minutes in a stand mixer (preferably fitted with paddle attachment) or 6 with a handheld. Beat in egg and vanilla. Reduce speed to low, then mix in flour.",
                "Halve dough and form each half into a disk, then wrap in wax paper. Put each disk in a resealable plastic bag and chill until firm enough to roll into balls, about 1 hour.",
                "Heat oven to 350°F with rack in middle. Line baking sheets with parchment paper.",
                "While oven heats, work with 1 piece of dough (keep remaining dough chilled). Roll 1 level tablespoon of dough into a ball, then roll in coarse sugar in a shallow bowl to coat completely. (If dough becomes too soft to roll easily into balls, quick-chill in the freezer or chill in the refrigerator.)",
                "Place balls 2 inches apart on a lined baking sheet. With the flat bottom of a glass, flatten balls into 2-inch rounds.",
                "Bake cookies, one sheet at time, until bottoms are golden, 12 to 15 minutes total. Cool on sheets 2 minutes, then transfer with a metal spatula to racks to cool completely. Make more cookies with remaining dough on cooled baking sheets."
            ],
            "fat": 4.0,
            "ingredients": {
                "unsalted butter" : "2",
                "sugar" : "1",
                "salt" : "0.5",
                "egg" : "1",
                "vanilla extract": "1",
                "flour" : "2",
                "coarse sugar" : "1",
                "Wax paper":"1"
            },
            "protein": 1.0,
            "rating": 3.75,
            "sodium": 26.0,
            "title": "Buttery Sugar Cookies "
            },
            {
            "calories": 92.0,
            "categories": [
                "Cookies",
                "Nut",
                "Dessert",
                "Bake",
                "Christmas",
                "Kid-Friendly",
                "Tree Nut",
                "Almond",
                "Edible Gift",
                "Christmas Eve",
                "Bon Appétit",
                "Kidney Friendly",
                "Vegetarian",
                "Pescatarian",
                "Peanut Free",
                "Soy Free",
                "Kosher"
            ],
            "date": 1383710400000,
            "desc": "Hand off this dough to the kids—or anyone with questionable baking skills—and let them go to town. Thumbprints can be any shape or size, and the fillings are customizable.",
            "directions": [
                "Place racks in lower and upper thirds of oven; preheat to 375°F. Pulse flour and almonds in a food processor until almonds are very finely ground. Add baking powder and salt and pulse to blend. Using an electric mixer on high speed, beat butter and sugar until light and fluffy, about 4 minutes. Add egg and vanilla and beat until pale and fluffy, about 4 minutes. Reduce speed to low and gradually add dry ingredients; mix just to combine.",
                "Place sanding sugar in a shallow bowl. Scoop out dough by the tablespoonful and roll into balls (if dough is sticky, chill 20 minutes). Roll in sugar and place on 2 parchment-lined baking sheets, spacing 2\" apart. Using your thumb, make a deep indent in each ball. (For more exaggerated cracks, bake dough 5 minutes before indenting.)",
                "Bake cookies, rotating baking sheets halfway through, until golden, 12–14 minutes. Transfer to wire racks and let cool. Fill with jam or curd (use a small spoon).",
                "MAKE AHEAD: Cookies can be baked (but not filled) 2 weeks ahead; wrap tightly and freeze. Thaw before filling. Cookies can be filled 1 day ahead; store airtight at room temperature."
            ],
            "fat": 6.0,
            "ingredients": {
                "flour" : "0.5",
                "unsalted roasted almonds" : "0.5",
                "baking powder" : "1",
                "kosher salt" : "0.5",
                "unsalted butter" : "1",
                "granulated sugar" : "0.5",
                "large egg" : "1",
                "vanilla extract" : "1",
                "raw sugar" : "0.5",
                "Jams lemon curd":"1"
            },
            "protein": 1.0,
            "rating": 4.375,
            "sodium": 51.0,
            "title": "Roasted-Almond Thumbprints "
            },
            {
            "calories": 76.0,
            "categories": [
                "Bon Appétit",
                "Bake",
                "Cookies",
                "Almond",
                "Lemon",
                "Dessert",
                "Wheat\/Gluten-Free",
                "Kidney Friendly",
                "Vegetarian",
                "Pescatarian",
                "Dairy Free",
                "Peanut Free",
                "Soy Free",
                "Kosher"
            ],
            "date": 1467398100000,
            "desc": "These traditional almond cookies hail from Tuscany; their texture is chewy, similar to macaroons.",
            "directions": [
                "Preheat oven to 350°F. Toast almonds on a rimmed baking sheet, tossing once, until golden, 5–8 minutes; let cool.",
                "Pulse almonds, lemon zest, and 1\/4 cup powdered sugar in a food processor until finely ground. Whisk egg white and salt in a large bowl to medium peaks. Whisking constantly, gradually add 1\/4 cup powdered sugar; whisk until egg white is very stiff but not dry. Fold in almond mixture and vanilla. Drop heaping tablespoonfuls of batter onto a parchment-lined baking sheet; using wet hands, flatten tops and press sides to make rounded diamond shapes. Chill 30 minutes.",
                "Bake ricciarelli until edges are lightly golden and firm and centers are still a little soft, 10–12 minutes; let cool on baking sheet. Dust with powdered sugar."
            ],
            "fat": 5.0,
            "ingredients": {
                "slivered almonds" : "0.25",
                "lemon zest" : "1",
                "powdered sugar" : "0.5",
                "egg white" : "1",
                "kosher salt":"0",
                "vanilla extract": "0.25"
            },
            "protein": 2.0,
            "rating": 0.0,
            "sodium": 15.0,
            "title": "Tuscan Almond Cookies (Ricciarelli) "
        }
    ],




    [
        {
            "calories": 547.0,
            "categories": [
                "Cheese",
                "Dairy",
                "Pasta",
                "Vegetable",
                "Side",
                "Bake",
                "Vegetarian",
                "Quick & Easy",
                "Fall",
                "Bon Appétit",
                "California"
            ],
            "date": "2004-08-20T04:00:00.000Z",
            "desc": null,
            "directions": [
                "Preheat oven to 350°F. Lightly grease 8x8x2-inch glass baking dish. Blend spinach, noodles, sour cream, pesto sauce and nutmeg in large bowl. Spoon mixture into prepared dish. Sprinkle cheese over. Bake until set, about 45 minutes. Let stand 10 minutes."
            ],
            "fat": 32.0,
            "ingredients": {
                "frozen spinach, thawed":"1",
                "egg noodles":"0.5",
                "sour cream":"1",
                "pesto sauce":"2",
                "nutmeg":"0.25",
                "grated cheddar cheese":"1"
            },
            "protein": 20.0,
            "rating": 3.125,
            "sodium": 452.0,
            "title": "Spinach Noodle Casserole "
        },
        {
            "calories": null,
            "categories": [
                "Milk\/Cream",
                "Cheese",
                "Leafy Green",
                "Pasta",
                "Bake",
                "Sauté",
                "High Fiber",
                "Dinner",
                "Parmesan",
                "Bacon",
                "Family Reunion",
                "Endive",
                "Breadcrumbs",
                "Bon Appétit"
            ],
            "date": "2009-11-02T04:00:00.000Z",
            "desc": null,
            "directions": [
                "Heat oil in heavy large skillet over medium heat. Add pancetta, celery, and onion. Sauté until vegetables are soft but not brown, about 12 minutes. Transfer 1\/2 cup sliced Treviso to small bowl and reserve for topping. Add remaining Treviso, 2 teaspoons thyme, and garlic to skillet. Toss until Treviso wilts, about 3 minutes. Season filling with salt and pepper.",
                "Cook lasagna noodles in large pot of boiling salted water until just tender but still firm to bite, stirring occasionally. Drain noodles. Arrange noodles in single layer on large sheet of plastic wrap; cover with second sheet to avoid drying. DO AHEAD: Filling and pasta can be made 2 hours ahead. Let stand at room temperature.",
                "Melt butter in heavy medium saucepan over medium-low heat. Add flour and whisk until roux is pale gold color, about 2 minutes. Gradually whisk in milk; add nutmeg and white pepper. Increase heat to medium and cook until sauce thickens and boils, whisking often, 2 to 3 minutes. Reduce heat to low. Add Taleggio cheese in 4 batches, whisking to melt before adding more, about 4 minutes. Season sauce to taste with salt and pepper.",
                "Spoon 1\/2 cup sauce into 13 x 9 x 2-inch glass baking dish; spread to cover bottom thinly. Arrange 3 noodles, crosswise and side by side, in dish; trim ends if necessary to fit. Transfer 3\/4 cup filling to another small bowl and reserve for topping. Spoon half of remaining filling over noodles. Drizzle with 2\/3 cup sauce; sprinkle with 1\/4 cup Parmesan cheese. Repeat with noodles, filling, sauce, and Parmesan. Top with third layer of noodles; drizzle with 2\/3 cup sauce. Spoon reserved 3\/4 cup filling down center of lasagna lengthwise in 2-inch-wide strip. Drizzle strip with remaining sauce, then top with breadcrumbs. DO AHEAD: Can be made 1 day ahead. Cover and chill. Let stand at room temperature 1 hour before continuing.",
                "Preheat oven to 375°F. Bake lasagna uncovered until heated through and sauce is bubbling, about 35 minutes. Remove from oven; let cool 15 minutes.",
                "Toss reserved Treviso in small bowl with splash of olive oil and sprinkle of salt and pepper. Sprinkle over strip of filling. Sprinkle with remaining 1 teaspoon thyme."
            ],
            "fat": null,
            "ingredients": {
                "pancetta":"8",
                "celery hearts":"2",
                "onion":"1",
                "red endive":"1",
                "fresh thyme":"3",
                "garlic":"1",
                "lasagna noodles":"9",
                "unsalted butter":"0.25",
                "flour":"2",
                "milk":"2",
                "nutmeg":"1",
                "white pepper":"1",
                "Taleggio cheese":"12",
                "Parmesan cheese":"0.5",
                "dry breadcrumbs":"2",
                "Olive oil":"4"
            },
            "protein": null,
            "rating": 3.75,
            "sodium": null,
            "title": "Pancetta and Taleggio Lasagna with Treviso "
            },
            {
            "calories": null,
            "categories": [
                "Cheese",
                "Herb",
                "Pasta",
                "Low Cal",
                "Dinner",
                "Lunch",
                "Casserole\/Gratin",
                "Parmesan",
                "Squash",
                "Butternut Squash",
                "Swiss Cheese",
                "Sage",
                "Fontina",
                "Simmer",
                "Boil",
                "Self",
                "Vegetarian",
                "Pescatarian",
                "Peanut Free",
                "Tree Nut Free",
                "Soy Free",
                "No Sugar Added",
                "Kosher"
            ],
            "date": "2013-11-13T04:00:00.000Z",
            "desc": "\"Creamy squash and cheese crisps only make you think you're off the diet cliff!\" says James Beard award winner Laura Werlin, author of Mac & Cheese, Please! and The All American Cheese and Wine Book.",
            "directions": [
                "Heat oven to 375°. On a parchment paper-lined baking sheet, shape Parmesan into 8 2-inch rounds. Bake until golden, 10 minutes; remove from sheet to cool. Cook pasta as directed on package; set aside. In a medium skillet over medium heat, melt 2 teaspoons butter. Cook whole sage leaves until crisp, 45 seconds. Transfer to a paper towel-lined plate, reserving butter. In the same skillet over medium heat, melt remaining 2 tablespoons butter. Add flour and cook, whisking constantly, until light brown, 1 minute. Slowly whisk in milk and cook, 5 minutes. Add squash, garlic, reserved butter and salt. Cover; simmer until squash is very soft, 25 minutes. In a food processor, puree squash mixture. In a pot over medium-low heat, heat squash puree, Fontina, Swiss, chopped sage and cayenne; stir until cheese melts. Stir in pasta. Serve with Parmesan crisps and sage leaves."
            ],
            "fat": null,
            "ingredients": {
                "Parmesan":"6",
                "shell pasta":"8",
                "butter":"2",
                "fresh sage leaves":"12",
                "flour":"2",
                "milk":"3",
                "butternut squash":"1",
                "garlic":"2",
                "salt":"0.5",
                "shredded Fontina":"2",
                "Swiss cheese":"1",
                "cayenne pepper":"0.25"
            },
            "protein": null,
            "rating": 5.0,
            "sodium": null,
            "title": "Fontina Mac with Squash and Sage "
            },
            {
            "calories": 634.0,
            "categories": [
                "Fish",
                "Leafy Green",
                "Pasta",
                "Tomato",
                "Bake",
                "Quick & Easy",
                "Halibut",
                "Spinach",
                "Healthy",
                "Bon Appétit",
                "California"
            ],
            "date": "2005-10-01T04:00:00.000Z",
            "desc": "Kristi Parnell of San Marcos, California, writes: \"Whether I'm cooking for my family or for company, I like to keep my recipes healthy by using lots of fresh fish and vegetables. The baked halibut here has become a weeknight staple.\"",
            "directions": [
                "Preheat oven to 425°F. Whisk 2 tablespoons oil and lemon juice in bowl; season dressing with salt and pepper. Place halibut on rimmed baking sheet; sprinkle with salt and pepper. Drizzle with some of dressing. Bake until just opaque in center, about 12 minutes.",
                "Meanwhile, cook pasta in large saucepan of boiling salted water until tender but still firm to bite; drain. Add 2 tablespoons oil and garlic to same saucepan; sauté over medium heat 1 minute. Add drained pasta, spinach, and tomatoes; stir to coat. Season with salt and pepper. Remove from heat. Cover; let stand 1 minute (spinach will wilt). Divide pasta between 2 plates. Top with halibut and remaining dressing."
            ],
            "fat": 31.0,
            "ingredients": {
                "olive oil":"4",
                "fresh lemon juice":"2",
                "halibut fillets":"2",
                "orzo":"1",
                "garlic":"1",
                "spinach":"4",
                "cherry tomatoes":"1"
            },
            "protein": 44.0,
            "rating": 4.375,
            "sodium": 181.0,
            "title": "Baked Halibut with Orzo, Spinach, and Cherry Tomatoes "
            },
        {
			"calories": 684.0,
			"categories": [
				"Cheese",
				"Dairy",
				"Garlic",
				"Herb",
				"Pasta",
				"Vegetable",
				"Bake",
				"Dinner",
				"Fall",
				"Winter",
				"Gourmet",
				"Vegetarian",
				"Pescatarian",
				"Peanut Free",
				"Tree Nut Free",
				"Soy Free",
				"No Sugar Added",
				"Kosher"
			],
			"date": "2004-08-20T04:00:00.000Z",
			"desc": null,
			"directions": [
				"Preheat oven to 450°F. and oil 2 large shallow baking pans.",
				"In a large bowl toss squash with oil until coated well and spread in one layer in pans. Roast squash in oven 10 minutes and season with salt. Stir squash and roast 10 to 15 minutes more, or until tender and beginning to turn golden.",
				"While squash is roasting, in a saucepan bring milk to a simmer with rosemary. Heat milk mixture over low heat 10 minutes and pour through a sieve into a large pitcher or measuring cup.",
				"In a large heavy saucepan cook garlic in butter over moderately low heat, stirring, until softened. Stir in flour and cook roux, stirring, 3 minutes. Remove pan from heat and whisk in milk mixture in a stream until smooth. Return pan to heat and simmer sauce, whisking occasionally, about 10 minutes, or until thick. Stir in squash and salt and pepper to taste. Sauce may be made 3 days ahead and chilled, its surface covered with plastic wrap.",
				"Reduce temperature to 375°F. and butter a baking dish, 13 by 9 by 2 inches.",
				"Pour 1 cup sauce into baking dish (sauce will not cover bottom completely) and cover with 3 lasagne sheets, making sure they do not touch each other. Spread half of remaining sauce over pasta and sprinkle with 1\/2 cup Parmesan. Make 1 more layer in same manner, beginning and ending with pasta.",
				"In a bowl with an electric mixer beat cream with salt until it holds soft peaks and spread evenly over top pasta layer, making sure pasta is completely covered. Sprinkle remaining 1\/3 cup Parmesan over cream. Cover dish tightly with foil, tenting slightly to prevent foil from touching top layer, and bake in middle of oven 30 minutes. Remove foil and bake lasagne 10 minutes more, or until top is bubbling and golden. Let lasagne stand 5 minutes.",
				"Garnish each serving with rosemary."
			],
			"fat": 42.0,
			"ingredients": {
				"butternut squash":"3",
				"vegetable oil":"3",
				"milk":"4",
				"dried rosemary":"2",
				"garlic":"1",
				"unsalted butter":"0.5",
				"flour":"4",
				"sheets dry lasagne pasta":"9",
				"Parmesan":"1",
				"heavy cream":"1",
				"salt":"0.5",
				"garnish":"1"
            },
			"protein": 21.0,
			"rating": 4.375,
			"sodium": 637.0,
			"title": "Roasted Butternut Squash, Rosemary, and Garlic Lasagne "
		}
    ]
]
