[
    {
      "calories": 547.0,
      "categories": [
        "Cheese",
        "Dairy",
        "Pasta",
        "Vegetable",
        "Side",
        "Bake",
        "Vegetarian",
        "Quick & Easy",
        "Fall",
        "Bon Appétit",
        "California"
      ],
      "date": "2004-08-20T04:00:00.000Z",
      "desc": null,
      "directions": [
        "Preheat oven to 350°F. Lightly grease 8x8x2-inch glass baking dish. Blend spinach, noodles, sour cream, pesto sauce and nutmeg in large bowl. Spoon mixture into prepared dish. Sprinkle cheese over. Bake until set, about 45 minutes. Let stand 10 minutes."
      ],
      "fat": 32.0,
      "ingredients": {
        "frozen spinach, thawed":"1",
        "egg noodles":"0.5",
        "sour cream":"1",
        "pesto sauce":"2",
        "nutmeg":"0.25",
        "grated cheddar cheese":"1"
      },
      "protein": 20.0,
      "rating": 3.125,
      "sodium": 452.0,
      "title": "Spinach Noodle Casserole "
    },
    {
      "calories": null,
      "categories": [
        "Milk\/Cream",
        "Cheese",
        "Leafy Green",
        "Pasta",
        "Bake",
        "Sauté",
        "High Fiber",
        "Dinner",
        "Parmesan",
        "Bacon",
        "Family Reunion",
        "Endive",
        "Breadcrumbs",
        "Bon Appétit"
      ],
      "date": "2009-11-02T04:00:00.000Z",
      "desc": null,
      "directions": [
        "Heat oil in heavy large skillet over medium heat. Add pancetta, celery, and onion. Sauté until vegetables are soft but not brown, about 12 minutes. Transfer 1\/2 cup sliced Treviso to small bowl and reserve for topping. Add remaining Treviso, 2 teaspoons thyme, and garlic to skillet. Toss until Treviso wilts, about 3 minutes. Season filling with salt and pepper.",
        "Cook lasagna noodles in large pot of boiling salted water until just tender but still firm to bite, stirring occasionally. Drain noodles. Arrange noodles in single layer on large sheet of plastic wrap; cover with second sheet to avoid drying. DO AHEAD: Filling and pasta can be made 2 hours ahead. Let stand at room temperature.",
        "Melt butter in heavy medium saucepan over medium-low heat. Add flour and whisk until roux is pale gold color, about 2 minutes. Gradually whisk in milk; add nutmeg and white pepper. Increase heat to medium and cook until sauce thickens and boils, whisking often, 2 to 3 minutes. Reduce heat to low. Add Taleggio cheese in 4 batches, whisking to melt before adding more, about 4 minutes. Season sauce to taste with salt and pepper.",
        "Spoon 1\/2 cup sauce into 13 x 9 x 2-inch glass baking dish; spread to cover bottom thinly. Arrange 3 noodles, crosswise and side by side, in dish; trim ends if necessary to fit. Transfer 3\/4 cup filling to another small bowl and reserve for topping. Spoon half of remaining filling over noodles. Drizzle with 2\/3 cup sauce; sprinkle with 1\/4 cup Parmesan cheese. Repeat with noodles, filling, sauce, and Parmesan. Top with third layer of noodles; drizzle with 2\/3 cup sauce. Spoon reserved 3\/4 cup filling down center of lasagna lengthwise in 2-inch-wide strip. Drizzle strip with remaining sauce, then top with breadcrumbs. DO AHEAD: Can be made 1 day ahead. Cover and chill. Let stand at room temperature 1 hour before continuing.",
        "Preheat oven to 375°F. Bake lasagna uncovered until heated through and sauce is bubbling, about 35 minutes. Remove from oven; let cool 15 minutes.",
        "Toss reserved Treviso in small bowl with splash of olive oil and sprinkle of salt and pepper. Sprinkle over strip of filling. Sprinkle with remaining 1 teaspoon thyme."
      ],
      "fat": null,
      "ingredients": {
        "pancetta":"8",
        "celery":"2",
        "onion":"1",
        "red endive":"1",
        "fresh thyme":"3",
        "garlic":"1",
        "lasagna":"9",
        "unsalted butter":"0.25",
        "flour":"2",
        "milk":"2",
        "nutmeg":"1",
        "white pepper":"1",
        "Taleggio":"12",
        "Parmesan":"0.5",
        "breadcrumbs":"2",
        "Olive oil":"4"
      },
      "protein": null,
      "rating": 3.75,
      "sodium": null,
      "title": "Pancetta and Taleggio Lasagna with Treviso "
    },
    {
      "calories": null,
      "categories": [
        "Cheese",
        "Herb",
        "Pasta",
        "Low Cal",
        "Dinner",
        "Lunch",
        "Casserole\/Gratin",
        "Parmesan",
        "Squash",
        "Butternut Squash",
        "Swiss Cheese",
        "Sage",
        "Fontina",
        "Simmer",
        "Boil",
        "Self",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
      ],
      "date": "2013-11-13T04:00:00.000Z",
      "desc": "\"Creamy squash and cheese crisps only make you think you're off the diet cliff!\" says James Beard award winner Laura Werlin, author of Mac & Cheese, Please! and The All American Cheese and Wine Book.",
      "directions": [
        "Heat oven to 375°. On a parchment paper-lined baking sheet, shape Parmesan into 8 2-inch rounds. Bake until golden, 10 minutes; remove from sheet to cool. Cook pasta as directed on package; set aside. In a medium skillet over medium heat, melt 2 teaspoons butter. Cook whole sage leaves until crisp, 45 seconds. Transfer to a paper towel-lined plate, reserving butter. In the same skillet over medium heat, melt remaining 2 tablespoons butter. Add flour and cook, whisking constantly, until light brown, 1 minute. Slowly whisk in milk and cook, 5 minutes. Add squash, garlic, reserved butter and salt. Cover; simmer until squash is very soft, 25 minutes. In a food processor, puree squash mixture. In a pot over medium-low heat, heat squash puree, Fontina, Swiss, chopped sage and cayenne; stir until cheese melts. Stir in pasta. Serve with Parmesan crisps and sage leaves."
      ],
      "fat": null,
      "ingredients": {
        "Parmesan":"6",
        "shell pasta":"8",
        "butter":"2",
        "fresh sage leaves":"12",
        "flour":"2",
        "milk":"3",
        "butternut squash":"1",
        "garlic":"2",
        "salt":"0.5",
        "shredded Fontina":"2",
        "Swiss cheese":"1",
        "cayenne pepper":"0.25"
      },
      "protein": null,
      "rating": 5.0,
      "sodium": null,
      "title": "Fontina Mac with Squash and Sage "
    },
    {
      "calories": 634.0,
      "categories": [
        "Fish",
        "Leafy Green",
        "Pasta",
        "Tomato",
        "Bake",
        "Quick & Easy",
        "Halibut",
        "Spinach",
        "Healthy",
        "Bon Appétit",
        "California"
      ],
      "date": "2005-10-01T04:00:00.000Z",
      "desc": "Kristi Parnell of San Marcos, California, writes: \"Whether I'm cooking for my family or for company, I like to keep my recipes healthy by using lots of fresh fish and vegetables. The baked halibut here has become a weeknight staple.\"",
      "directions": [
        "Preheat oven to 425°F. Whisk 2 tablespoons oil and lemon juice in bowl; season dressing with salt and pepper. Place halibut on rimmed baking sheet; sprinkle with salt and pepper. Drizzle with some of dressing. Bake until just opaque in center, about 12 minutes.",
        "Meanwhile, cook pasta in large saucepan of boiling salted water until tender but still firm to bite; drain. Add 2 tablespoons oil and garlic to same saucepan; sauté over medium heat 1 minute. Add drained pasta, spinach, and tomatoes; stir to coat. Season with salt and pepper. Remove from heat. Cover; let stand 1 minute (spinach will wilt). Divide pasta between 2 plates. Top with halibut and remaining dressing."
      ],
      "fat": 31.0,
      "ingredients": {
        "olive oil":"4",
        "fresh lemon juice":"2",
        "halibut fillets":"2",
        "orzo":"1",
        "garlic":"1",
        "spinach":"4",
        "cherry tomatoes":"1"
      },
      "protein": 44.0,
      "rating": 4.375,
      "sodium": 181.0,
      "title": "Baked Halibut with Orzo, Spinach, and Cherry Tomatoes "
    },
    {
			"calories": 684.0,
			"categories": [
				"Cheese",
				"Dairy",
				"Garlic",
				"Herb",
				"Pasta",
				"Vegetable",
				"Bake",
				"Dinner",
				"Fall",
				"Winter",
				"Gourmet",
				"Vegetarian",
				"Pescatarian",
				"Peanut Free",
				"Tree Nut Free",
				"Soy Free",
				"No Sugar Added",
				"Kosher"
			],
			"date": "2004-08-20T04:00:00.000Z",
			"desc": null,
			"directions": [
				"Preheat oven to 450°F. and oil 2 large shallow baking pans.",
				"In a large bowl toss squash with oil until coated well and spread in one layer in pans. Roast squash in oven 10 minutes and season with salt. Stir squash and roast 10 to 15 minutes more, or until tender and beginning to turn golden.",
				"While squash is roasting, in a saucepan bring milk to a simmer with rosemary. Heat milk mixture over low heat 10 minutes and pour through a sieve into a large pitcher or measuring cup.",
				"In a large heavy saucepan cook garlic in butter over moderately low heat, stirring, until softened. Stir in flour and cook roux, stirring, 3 minutes. Remove pan from heat and whisk in milk mixture in a stream until smooth. Return pan to heat and simmer sauce, whisking occasionally, about 10 minutes, or until thick. Stir in squash and salt and pepper to taste. Sauce may be made 3 days ahead and chilled, its surface covered with plastic wrap.",
				"Reduce temperature to 375°F. and butter a baking dish, 13 by 9 by 2 inches.",
				"Pour 1 cup sauce into baking dish (sauce will not cover bottom completely) and cover with 3 lasagne sheets, making sure they do not touch each other. Spread half of remaining sauce over pasta and sprinkle with 1\/2 cup Parmesan. Make 1 more layer in same manner, beginning and ending with pasta.",
				"In a bowl with an electric mixer beat cream with salt until it holds soft peaks and spread evenly over top pasta layer, making sure pasta is completely covered. Sprinkle remaining 1\/3 cup Parmesan over cream. Cover dish tightly with foil, tenting slightly to prevent foil from touching top layer, and bake in middle of oven 30 minutes. Remove foil and bake lasagne 10 minutes more, or until top is bubbling and golden. Let lasagne stand 5 minutes.",
				"Garnish each serving with rosemary."
			],
			"fat": 42.0,
			"ingredients": {
				"butternut squash":"3",
				"vegetable oil":"3",
				"milk":"4",
				"dried rosemary":"2",
				"garlic":"1",
				"unsalted butter":"0.5",
				"flour":"4",
				"lasagne pasta":"9",
				"Parmesan":"1",
				"heavy cream":"1",
				"salt":"0.5",
				"garnish":"1"
      },
			"protein": 21.0,
			"rating": 4.375,
			"sodium": 637.0,
			"title": "Roasted Butternut Squash, Rosemary, and Garlic Lasagne "
		}
]
