[
    {
      "calories": 426.0,
      "categories": [
        "Sandwich",
        "Bean",
        "Fruit",
        "Tomato",
        "turkey",
        "Vegetable",
        "Kid-Friendly",
        "Apple",
        "Lentil",
        "Lettuce",
        "Cookie"
      ],
      "date": "2006-09-01T04:00:00.000Z",
      "desc": null,
      "directions": [
        "1. Place the stock, lentils, celery, carrot, thyme, and salt in a medium saucepan and bring to a boil. Reduce heat to low and simmer until the lentils are tender, about 30 minutes, depending on the lentils. (If they begin to dry out, add water as needed.) Remove and discard the thyme. Drain and transfer the mixture to a bowl; let cool.",
        "2. Fold in the tomato, apple, lemon juice, and olive oil. Season with the pepper.",
        "3. To assemble a wrap, place 1 lavash sheet on a clean work surface. Spread some of the lentil mixture on the end nearest you, leaving a 1-inch border. Top with several slices of turkey, then some of the lettuce. Roll up the lavash, slice crosswise, and serve. If using tortillas, spread the lentils in the center, top with the turkey and lettuce, and fold up the bottom, left side, and right side before rolling away from you."
      ],
      "fat": 7.0,
      "ingredients": {
        "chicken stock":"4",
        "dried lentils":"1",
        "green lentils":"0.5",
        "celery":"2",
        "carrot":"1",
        "fresh thyme":"1",
        "salt":"1",
        "tomato":"1",
        "Fuji apple":"1",
        "lemon juice":"1",
        "olive oil":"2",
        "sheets wheat":"3",
        "turkey breast":"0.75",
        "lettuce":"0.5"
      },
      "protein": 30.0,
      "rating": 2.5,
      "sodium": 559.0,
      "title": "Lentil, Apple, and Turkey Wrap "
    },
    {
      "calories": 948.0,
      "categories": [
        "Sandwich",
        "Food Processor",
        "Tomato",
        "Kid-Friendly",
        "Quick & Easy",
        "Basil",
        "Bacon",
        "Summer",
        "Lettuce",
        "Bon Appétit"
      ],
      "date": "2004-08-20T04:00:00.000Z",
      "desc": "This recipe can be prepared in 45 minutes or less.",
      "directions": [
        "Mix basil, mayonnaise and butter in processor until basil is finely chopped and mixture is well blended. Season to taste with salt and pepper. (Can be made 1 day ahead. Cover and refrigerate.)",
        "Cook bacon in heavy large skillet over medium-high heat until crisp, about 8 minutes. Transfer to paper towels; drain.",
        "Spread half of mayonnaise mixture over 1 side of 6 bread slices. Top each with 2 tomato slices. Sprinkle tomatoes with salt and pepper. Top tomato slices with avocado, then with bacon strips, onion and lettuce. Spread remaining mayonnaise mixture over remaining 6 bread slices. Place bread slices atop lettuce. Cut sandwiches in half and serve."
      ],
      "fat": 79.0,
      "ingredients": {
        "basil":"2",
        "mayonnaise":"1",
        "butter":"0.25",
        "bacon strips":"12",
        "bread ":"12",
        "tomatoes":"3",
        "avocados":"2",
        "red onion":"1",
        "lettuce":"6"
      },
      "protein": 19.0,
      "rating": 4.375,
      "sodium": 1042.0,
      "title": "The Best Blts "
    },
    {
      "calories": 904.0,
      "categories": [
        "Sandwich",
        "Beef",
        "Cheese",
        "Mushroom",
        "Mustard",
        "Quick & Easy",
        "Mozzarella",
        "Ground Beef",
        "Veal",
        "Fall",
        "Winter",
        "Bon Appétit"
      ],
      "date": "2004-08-20T04:00:00.000Z",
      "desc": null,
      "directions": [
        "Mix cheese and green onions in medium bowl. Gently mix ground veal, Worcestershire sauce, salt and pepper in large bowl. Divide veal mixture into 4 equal portions. Divide 1 portion in half; form two 1\/8-inch-thick patties. Place 1\/4 cup cheese mixture atop 1 patty; top with second patty. Seal at edges to enclose cheese mixture. Repeat with remaining 3 portions.",
        "Mix mayonnaise, mustard, lemon peel and sage in small bowl. (Patties and mayonnaise mixture can be made 2 hours ahead. Cover separately and refrigerate.) Preheat oven to 400°F. Place mushrooms on rimmed baking sheet. Combine 4 tablespoons oil and garlic. Brush over both sides of mushrooms. Sprinkle with salt and pepper. Roast mushrooms until tender, turning once, about 20 minutes.",
        "Heat remaining 2 tablespoons oil in heavy large skillet over medium-high heat. Add burgers and cook until cheese melts, about 5 minutes per side.",
        "Spread mayonnaise mixture over buns. Place burgers on bottom halves. Top with mushrooms, then with bun tops."
      ],
      "fat": 70.0,
      "ingredients": {
        "mozzarella":"1",
        "onions":"0.25",
        "veal":"1",
        "Worcestershire":"2",
        "salt":"1",
        "mayonnaise":"0.5",
        "mustard":"2",
        "lemon peel":"1",
        "rubbed sage":"0.5",
        "mushrooms":"4",
        "olive oil":"6",
        "garlic cloves":"2",
        "sesame buns":"4"
      },
      "protein": 38.0,
      "rating": 4.375,
      "sodium": 1413.0,
      "title": "Veal Burgers Stuffed with Mozzarella Cheese "
    },
    {
      "calories": 641.0,
      "categories": [
        "Sandwich",
        "Beef",
        "Cheese",
        "Leafy Green",
        "Onion",
        "Quick & Easy",
        "Blue Cheese",
        "Arugula",
        "Spring",
        "Bon Appétit"
      ],
      "date": "2004-08-20T04:00:00.000Z",
      "desc": null,
      "directions": [
        "Mash first 3 ingredients in small bowl until almost smooth. Place bread on work surface and spread mixture on 1 side of each slice. Top each of 4 bread slices with 1\/4 of beef, then onion and arugula. Season with pepper. Top with remaining bread, cheese side down.",
        "Melt butter in heavy large skillet over medium-high heat. Add sandwiches and cook until golden, about 2 minutes per side. Serve hot."
      ],
      "fat": 37.0,
      "ingredients": {
        "Stilton cheese":"1",
        "mayonnaise":"2",
        "horseradish":"1",
        "sourdough bread":"8",
        "roast beef":"1",
        "red onion":"0.5",
        "bunch arugula":"1",
        "butter":"2"
      },
      "protein": 39.0,
      "rating": 4.375,
      "sodium": 907.0,
      "title": "Grilled Roast Beef and Stilton Sandwich "
    },
    {
        "calories": null,
        "categories": [
          "Sandwich",
          "No-Cook",
          "Kid-Friendly",
          "Back to School",
          "Lunch",
          "Cream Cheese",
          "Strawberry",
          "Peanut",
          "Birthday",
          "Honey",
          "Party",
          "Vegetarian",
          "Pescatarian",
          "Tree Nut Free",
          "Soy Free",
          "Kosher"
        ],
        "date": "2009-04-20T04:00:00.000Z",
        "desc": "Peanut butter goes well with more than just jam, and this interesting combination proves it. This is delicious with whatever fruit is in season.",
        "directions": [
          "Lay the bread slices on a work surface. Spread the peanut butter on one slice and the cream cheese on the other.",
          "Arrange strawberry slices in an even single layer on top of the peanut butter. Drizzle the honey on the berries and then place the other slice of bread with the cream cheese on top. Cut into halves or quarters."
        ],
        "fat": null,
        "ingredients": {
          "Banana Bread":"2",
          "butter":"1",
          "cream cheese":"1",
          "strawberries":"2",
          "honey":"1"
        },
        "protein": null,
        "rating": 3.75,
        "sodium": null,
        "title": "Peanut Butter Berry–Wich "
      }
  ]